itxs/STM32F7/stm32f4_uvc_practice_ecl_F7/Src/usbd_conf.c
#include "stm32f7xx.h"
#include "stm32f7xx_hal.h"
#include "usbd_def.h"
#include "usbd_core.h"

PCD_HandleTypeDef hpcd_USB_OTG;
void SystemClock_Config(void);

/*******************************************************************************
						 LL Driver Callbacks (PCD -> USB Device Library)
*******************************************************************************/

/**
	* @brief	Setup stage callback
	* @param	hpcd: PCD handle
	* @retval None

	*/
void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd)
{
	USBD_LL_SetupStage(hpcd->pData, (uint8_t *)hpcd->Setup);
}

/**
	* @brief	Data Out stage callback.
	* @param	hpcd: PCD handle
	* @param	epnum: Endpoint Number
	* @retval None
	*/
void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
	USBD_LL_DataOutStage(hpcd->pData, epnum, hpcd->OUT_ep[epnum].xfer_buff);
}

/**
	* @brief	Data In stage callback..
	* @param	hpcd: PCD handle
	* @param	epnum: Endpoint Number
	* @retval None
	*/
void HAL_PCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
	USBD_LL_DataInStage(hpcd->pData, epnum, hpcd->IN_ep[epnum].xfer_buff);
}

/**
	* @brief	SOF callback.
	* @param	hpcd: PCD handle
	* @retval None
	*/
void HAL_PCD_SOFCallback(PCD_HandleTypeDef *hpcd)
{
	USBD_LL_SOF(hpcd->pData);
}

/**
	* @brief	Reset callback.
	* @param	hpcd: PCD handle
	* @retval None
	*/
void HAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd)
{
	USBD_SpeedTypeDef speed = USBD_SPEED_FULL;

	/*Set USB Current Speed*/
	switch (hpcd->Init.speed)
	{
	case PCD_SPEED_HIGH:
	speed = USBD_SPEED_HIGH;
	break;
	case PCD_SPEED_FULL:
	speed = USBD_SPEED_FULL;
	break;

	default:
	speed = USBD_SPEED_FULL;
	break;
	}
	USBD_LL_SetSpeed(hpcd->pData, speed);

	/*Reset Device*/
	USBD_LL_Reset(hpcd->pData);
}

/**
	* @brief	Suspend callback.
	* When Low power mode is enabled the debug cannot be used (IAR, Keil doesn't support it)
	* @param	hpcd: PCD handle
	* @retval None
	*/
void HAL_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd)
{
	 /* Inform USB library that core enters in suspend Mode */
	USBD_LL_Suspend(hpcd->pData);
	__HAL_PCD_GATE_PHYCLOCK(hpcd);
	/*Enter in STOP mode */
	/* USER CODE BEGIN 2 */
	if (hpcd->Init.low_power_enable)
	{
	/* Set SLEEPDEEP bit and SleepOnExit of Cortex System Control Register */
	SCB->SCR |= (uint32_t)((uint32_t)(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk));
	}
	/* USER CODE END 2 */
}

/**
	* @brief	Resume callback.
	When Low power mode is enabled the debug cannot be used (IAR, Keil doesn't support it)
	* @param	hpcd: PCD handle
	* @retval None
	*/
void HAL_PCD_ResumeCallback(PCD_HandleTypeDef *hpcd)
{
	/* USER CODE BEGIN 3 */
	/* USER CODE END 3 */
	USBD_LL_Resume(hpcd->pData);
}

/**
	* @brief	ISOC Out Incomplete callback.
	* @param	hpcd: PCD handle
	* @param	epnum: Endpoint Number
	* @retval None
	*/
void HAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
	USBD_LL_IsoOUTIncomplete(hpcd->pData, epnum);
}

/**
	* @brief	ISOC In Incomplete callback.
	* @param	hpcd: PCD handle
	* @param	epnum: Endpoint Number
	* @retval None
	*/
void HAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
	USBD_LL_IsoINIncomplete(hpcd->pData, epnum);
}

/**
	* @brief	Connect callback.
	* @param	hpcd: PCD handle
	* @retval None
	*/
void HAL_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd)
{
	USBD_LL_DevConnected(hpcd->pData);
}

/**
	* @brief	Disconnect callback.
	* @param	hpcd: PCD handle
	* @retval None
	*/
void HAL_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd)
{
	USBD_LL_DevDisconnected(hpcd->pData);
}

/*******************************************************************************
						 LL Driver Interface (USB Device Library --> PCD)
*******************************************************************************/
/**
	* @brief	Initializes the Low Level portion of the Device driver.
	* @param	pdev: Device handle
	* @retval USBD Status
	*/
USBD_StatusTypeDef	USBD_LL_Init (USBD_HandleTypeDef *pdev)
{
	USBD_StatusTypeDef status;

	/* Link The driver to the stack */
	hpcd_USB_OTG.pData = pdev;
	pdev->pData = &hpcd_USB_OTG;
	
	/* Init USB_IP */
	hpcd_USB_OTG.Init.dev_endpoints = 4;
	hpcd_USB_OTG.Init.Sof_enable = ENABLE;
	hpcd_USB_OTG.Init.ep0_mps = DEP0CTL_MPS_64;
	
	if (pdev->id == DEVICE_FS)
	{
	hpcd_USB_OTG.Instance = USB_OTG_FS;
	hpcd_USB_OTG.Init.speed = PCD_SPEED_FULL;
	hpcd_USB_OTG.Init.phy_itface = PCD_PHY_EMBEDDED;
	}
	else if (pdev->id == DEVICE_HS)
	{
	hpcd_USB_OTG.Instance = USB_OTG_HS;
	hpcd_USB_OTG.Init.speed = PCD_SPEED_HIGH;
	hpcd_USB_OTG.Init.phy_itface = USB_OTG_ULPI_PHY;
	}
	
	if (HAL_PCD_Init(&hpcd_USB_OTG) != HAL_OK)
	{
	status = USBD_FAIL;
	}
	
	/* Init USB FIFOs */
	if (pdev->id == DEVICE_FS)
	{
	HAL_PCDEx_SetRxFiFo(&hpcd_USB_OTG, 64);
	HAL_PCDEx_SetTxFiFo(&hpcd_USB_OTG, 0, 64);
	HAL_PCDEx_SetTxFiFo(&hpcd_USB_OTG, 1, 192);
	}
	else if (pdev->id == DEVICE_HS)
	{
	HAL_PCD_SetRxFiFo(&hpcd_USB_OTG, 0x100);
	HAL_PCD_SetTxFiFo(&hpcd_USB_OTG, 0, 0x200);
	HAL_PCD_SetTxFiFo(&hpcd_USB_OTG, 1, 0x200);
	}
	
	return status;
}

/**
	* @brief	De-Initializes the Low Level portion of the Device driver.
	* @param	pdev: Device handle
	* @retval USBD Status
	*/
USBD_StatusTypeDef	USBD_LL_DeInit (USBD_HandleTypeDef *pdev)
{
	HAL_PCD_DeInit(pdev->pData);
	return USBD_OK;
}

/**
	* @brief	Starts the Low Level portion of the Device driver.
	* @param	pdev: Device handle
	* @retval USBD Status
	*/
USBD_StatusTypeDef	USBD_LL_Start(USBD_HandleTypeDef *pdev)
{
	HAL_PCD_Start(pdev->pData);
	return USBD_OK;
}

/**
	* @brief	Stops the Low Level portion of the Device driver.
	* @param	pdev: Device handle
	* @retval USBD Status
	*/
USBD_StatusTypeDef	USBD_LL_Stop (USBD_HandleTypeDef *pdev)
{
	HAL_PCD_Stop(pdev->pData);
	return USBD_OK;
}

/**
	* @brief	Opens an endpoint of the Low Level Driver.
	* @param	pdev: Device handle
	* @param	ep_addr: Endpoint Number
	* @param	ep_type: Endpoint Type
	* @param	ep_mps: Endpoint Max Packet Size
	* @retval USBD Status
	*/
USBD_StatusTypeDef	USBD_LL_OpenEP	(USBD_HandleTypeDef *pdev,
										uint8_t	ep_addr,
										uint8_t	ep_type,
										uint16_t ep_mps)
{

	HAL_PCD_EP_Open(pdev->pData,
					ep_addr,
					ep_mps,
					ep_type);

	return USBD_OK;
}

/**
	* @brief	Closes an endpoint of the Low Level Driver.
	* @param	pdev: Device handle
	* @param	ep_addr: Endpoint Number
	* @retval USBD Status
	*/
USBD_StatusTypeDef	USBD_LL_CloseEP (USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{

	HAL_PCD_EP_Close(pdev->pData, ep_addr);
	return USBD_OK;
}

/**
	* @brief	Flushes an endpoint of the Low Level Driver.
	* @param	pdev: Device handle
	* @param	ep_addr: Endpoint Number
	* @retval USBD Status
	*/
USBD_StatusTypeDef	USBD_LL_FlushEP (USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{

	HAL_PCD_EP_Flush(pdev->pData, ep_addr);
	return USBD_OK;
}

/**
	* @brief	Sets a Stall condition on an endpoint of the Low Level Driver.
	* @param	pdev: Device handle
	* @param	ep_addr: Endpoint Number
	* @retval USBD Status
	*/
USBD_StatusTypeDef	USBD_LL_StallEP (USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{

	HAL_PCD_EP_SetStall(pdev->pData, ep_addr);
	return USBD_OK;
}

/**
	* @brief	Clears a Stall condition on an endpoint of the Low Level Driver.
	* @param	pdev: Device handle
	* @param	ep_addr: Endpoint Number
	* @retval USBD Status
	*/
USBD_StatusTypeDef	USBD_LL_ClearStallEP (USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{

	HAL_PCD_EP_ClrStall(pdev->pData, ep_addr);
	return USBD_OK;
}

/**
	* @brief	Returns Stall condition.
	* @param	pdev: Device handle
	* @param	ep_addr: Endpoint Number
	* @retval Stall (1: Yes, 0: No)
	*/
uint8_t USBD_LL_IsStallEP (USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
	PCD_HandleTypeDef *hpcd = pdev->pData;

	if((ep_addr & 0x80) == 0x80)
	{
	return hpcd->IN_ep[ep_addr & 0x7F].is_stall;
	}
	else
	{
	return hpcd->OUT_ep[ep_addr & 0x7F].is_stall;
	}
}
/**
	* @brief	Assigns a USB address to the device.
	* @param	pdev: Device handle
	* @param	ep_addr: Endpoint Number
	* @retval USBD Status
	*/
USBD_StatusTypeDef	USBD_LL_SetUSBAddress (USBD_HandleTypeDef *pdev, uint8_t dev_addr)
{

	HAL_PCD_SetAddress(pdev->pData, dev_addr);
	return USBD_OK;
}

/**
	* @brief	Transmits data over an endpoint.
	* @param	pdev: Device handle
	* @param	ep_addr: Endpoint Number
	* @param	pbuf: Pointer to data to be sent
	* @param	size: Data size
	* @retval USBD Status
	*/
USBD_StatusTypeDef	USBD_LL_Transmit (USBD_HandleTypeDef *pdev,
										uint8_t	ep_addr,
										uint8_t	*pbuf,
										uint16_t	size)
{

	HAL_PCD_EP_Transmit(pdev->pData, ep_addr, pbuf, size);
	return USBD_OK;
}

/**
	* @brief	Prepares an endpoint for reception.
	* @param	pdev: Device handle
	* @param	ep_addr: Endpoint Number
	* @param	pbuf: Pointer to data to be received
	* @param	size: Data size
	* @retval USBD Status
	*/
USBD_StatusTypeDef	USBD_LL_PrepareReceive(USBD_HandleTypeDef *pdev,
											 uint8_t	ep_addr,
											 uint8_t	*pbuf,
											 uint16_t	size)
{

	HAL_PCD_EP_Receive(pdev->pData, ep_addr, pbuf, size);
	return USBD_OK;
}

/**
	* @brief	Returns the last transfered packet size.
	* @param	pdev: Device handle
	* @param	ep_addr: Endpoint Number
	* @retval Recived Data Size
	*/
uint32_t USBD_LL_GetRxDataSize	(USBD_HandleTypeDef *pdev, uint8_t	ep_addr)
{
	return HAL_PCD_EP_GetRxCount(pdev->pData, ep_addr);
}

#if (USBD_LPM_ENABLED == 1)
/**
	* @brief	HAL_PCDEx_LPM_Callback : Send LPM message to user layer
	* @param	hpcd: PCD handle
	* @param	msg: LPM message
	* @retval HAL status
	*/
void HAL_PCDEx_LPM_Callback(PCD_HandleTypeDef *hpcd, PCD_LPM_MsgTypeDef msg)
{
	switch ( msg)
	{
	case PCD_LPM_L0_ACTIVE:
	if (hpcd->Init.low_power_enable)
	{
		SystemClock_Config();

		/* Reset SLEEPDEEP bit of Cortex System Control Register */
		SCB->SCR &= (uint32_t)~((uint32_t)(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk));
	}
	__HAL_PCD_UNGATE_PHYCLOCK(hpcd);
	USBD_LL_Resume(hpcd->pData);
	break;

	case PCD_LPM_L1_ACTIVE:
	__HAL_PCD_GATE_PHYCLOCK(hpcd);
	USBD_LL_Suspend(hpcd->pData);

	/*Enter in STOP mode */
	if (hpcd->Init.low_power_enable)
	{
		/* Set SLEEPDEEP bit and SleepOnExit of Cortex System Control Register */
		SCB->SCR |= (uint32_t)((uint32_t)(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk));
	}
	break;
	}
}
#endif
/**
	* @brief	Delays routine for the USB Device Library.
	* @param	Delay: Delay in ms
	* @retval None
	*/
void	USBD_LL_Delay (uint32_t Delay)
{
	HAL_Delay(Delay);
}
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
